Revit 2024 API
PipePressureDropData.Roughness Property
 The roughness of the pipe. Units: (ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Roughness { get; }
Visual Basic
Public ReadOnly Property Roughness As Double
	Get
Visual C++
public:
property double Roughness {
	double get ();
}
See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace